Policies/Sample Policies/Conversion/REST to SOAP-Files/Create New SOAP Message.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
<soap12:Body>
<ns:getPrice xmlns:ns="http://quickstart.samples/xsd">
<!-- Zero or one occurrences -->
<ns:symbol>${http.querystring.symbol}</ns:symbol>
</ns:getPrice>
</soap12:Body>
</soap12:Envelope>

